Revit 2024 API
ACADVersion Enumeration
 An enumerated type listing available AutoCAD versions, into which a file may be exported.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum ACADVersion
Visual Basic
Public Enumeration ACADVersion
Visual C++
public enum class ACADVersion
Members
Member name | Description
R2007 |  AutoCAD 2007 file format.
R2010 |  AutoCAD 2010 file format.
R2013 |  AutoCAD 2013 file format.
Default |  The Autodesk Revit application's default export format.
R2018 |  AutoCAD 2018 file format.
See Also
Autodesk.Revit.DB Namespace